In [1]:
import pandas as pd

In [2]:
## Pandas - Series is one dimensional array.

my_series = pd.Series([1,2,3,4])

print(my_series, type(my_series))

0    1
1    2
2    3
3    4
dtype: int64 <class 'pandas.core.series.Series'>

In [3]:
## Create a series from dictionary.

data={'a':'1','b':'2','c':'3'}

dict_series = pd.Series(data)

print(dict_series, type(dict_series))

a    1
b    2
c    3
dtype: object <class 'pandas.core.series.Series'>

In [6]:
my_data1=[10,20,30]
index=['a','b','c']

my_series1 = pd.Series(my_data1,index=index)

print(my_series1, type(my_series1))

a    10
b    20
c    30
dtype: int64 <class 'pandas.core.series.Series'>

In [7]:
## Data Frame - it is two dimensional data with mutable.

## Create at dataframe from a dictionary.

my_dict1={
    'name': ['Vinoad','Rishibha','Samrat'],
    'age':[39,36,1],
    'place':['Sonipat','Meerut','Vancouver']
}

print(my_dict1, type(my_dict1))

{'name': ['Vinoad', 'Rishibha', 'Samrat'], 'age': [39, 36, 1], 'place': ['Sonipat', 'Meerut', 'Vancouver']} <class 'dict'>

In [12]:
df = pd.DataFrame(my_dict1)

print(df)

       name  age      place
0    Vinoad   39    Sonipat
1  Rishibha   36     Meerut
2    Samrat    1  Vancouver

In [9]:
type(pd.DataFrame(my_dict1))

pandas.core.frame.DataFrame

In [10]:
import numpy as np

np.array(my_dict1)

array({'name': ['Vinoad', 'Rishibha', 'Samrat'], 'age': [39, 36, 1], 'place': ['Sonipat', 'Meerut', 'Vancouver']},
      dtype=object)

In [13]:
## Create a dataframe from list of dictionaries.

my_list1=[
    {'name':'Vinoad','Age':39,'Place':'Sonipat'},
    {'name':'Rishibha','Age':36,'Place':'Meerut'},
    {'name':'Samrat','Age':1,'Place':'Vancouver'},
]

pd.DataFrame(my_list1)

       name  Age      Place
0    Vinoad   39    Sonipat
1  Rishibha   36     Meerut
2    Samrat    1  Vancouver

In [46]:
stud_df=pd.read_csv('info.csv')

In [47]:
stud_df.head(5)

       Name  age        place
0    Vinoad   39      Sonipat
1  Rishibha   36       Meerut
2    Samrat    1    Vancouver
3      John    3  Switzerland
4    Olivia    6        Spain

In [48]:
stud_df.tail(5)

       Name  age        place
1  Rishibha   36       Meerut
2    Samrat    1    Vancouver
3      John    3  Switzerland
4    Olivia    6        Spain
5     Krish    9      Seattle

In [49]:
## Accessing the data from dataframe.

stud_df['age']

0    39
1    36
2     1
3     3
4     6
5     9
Name: age, dtype: int64

In [50]:
## if we fecth one column from dataframe it would be series.

print(type(stud_df))

print(type(stud_df['age']))

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.series.Series'>

In [51]:
## Access the Row loc and columns - iloc

stud_df.head(5)

       Name  age        place
0    Vinoad   39      Sonipat
1  Rishibha   36       Meerut
2    Samrat    1    Vancouver
3      John    3  Switzerland
4    Olivia    6        Spain

In [52]:
print(stud_df.loc[0])

Name      Vinoad
age           39
place    Sonipat
Name: 0, dtype: object

In [53]:
print(stud_df.iloc[0])

Name      Vinoad
age           39
place    Sonipat
Name: 0, dtype: object

In [54]:
print(stud_df['age'])

0    39
1    36
2     1
3     3
4     6
5     9
Name: age, dtype: int64

In [56]:
print(stud_df.iloc[0][0])
print('\n')
print(stud_df.iloc[0][1])
print('\n')
print(stud_df.iloc[0][2])
print('\n')

Vinoad


39


Sonipat

/var/folders/84/tf1t91ps1s553nsrgqwnm6cw0000gn/T/ipykernel_25486/2727938775.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(stud_df.iloc[0][0])
/var/folders/84/tf1t91ps1s553nsrgqwnm6cw0000gn/T/ipykernel_25486/2727938775.py:3: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(stud_df.iloc[0][1])
/var/folders/84/tf1t91ps1s553nsrgqwnm6cw0000gn/T/ipykernel_25486/2727938775.py:5: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(stud_df.iloc[0][2])

In [62]:
## Accessing a spedified element.

stud_df.at[2,'place']

'Vancouver'

In [64]:
stud_df.iat[2,2]

'Vancouver'

In [78]:
## Data manipulation in data frame

stud_df['salary']=['60K', '50K', '30K', '25K', '20K','10K']

In [73]:
stud_df.head(10)

       Name  age        place salary
0    Vinoad   39      Sonipat    60K
1  Rishibha   36       Meerut    50K
2    Samrat    1    Vancouver    30K
3      John    3  Switzerland    25K
4    Olivia    6        Spain    20K
5     Krish    9      Seattle    10K

In [74]:
## Remove a columns.

#stud_df.drop('salary')

stud_df.drop('salary',axis=1)

       Name  age        place
0    Vinoad   39      Sonipat
1  Rishibha   36       Meerut
2    Samrat    1    Vancouver
3      John    3  Switzerland
4    Olivia    6        Spain
5     Krish    9      Seattle

In [75]:
stud_df

       Name  age        place salary
0    Vinoad   39      Sonipat    60K
1  Rishibha   36       Meerut    50K
2    Samrat    1    Vancouver    30K
3      John    3  Switzerland    25K
4    Olivia    6        Spain    20K
5     Krish    9      Seattle    10K

In [76]:
stud_df.drop('salary',axis=1,inplace=True)

In [77]:
stud_df

       Name  age        place
0    Vinoad   39      Sonipat
1  Rishibha   36       Meerut
2    Samrat    1    Vancouver
3      John    3  Switzerland
4    Olivia    6        Spain
5     Krish    9      Seattle

In [79]:
## Add age to the column.

stud_df['age']=stud_df['age']+1

In [80]:
stud_df

       Name  age        place salary
0    Vinoad   40      Sonipat    60K
1  Rishibha   37       Meerut    50K
2    Samrat    2    Vancouver    30K
3      John    4  Switzerland    25K
4    Olivia    7        Spain    20K
5     Krish   10      Seattle    10K

In [81]:
## Drop based on row.
stud_df.drop(0)

stud_df.drop(0, inplace=True)

       Name  age        place salary
1  Rishibha   37       Meerut    50K
2    Samrat    2    Vancouver    30K
3      John    4  Switzerland    25K
4    Olivia    7        Spain    20K
5     Krish   10      Seattle    10K

In [82]:
stud_df

       Name  age        place salary
0    Vinoad   40      Sonipat    60K
1  Rishibha   37       Meerut    50K
2    Samrat    2    Vancouver    30K
3      John    4  Switzerland    25K
4    Olivia    7        Spain    20K
5     Krish   10      Seattle    10K

In [83]:
## Statistical summary for numerical columns.
stud_df.describe()

             age
count   6.000000
mean   16.666667
std    17.154203
min     2.000000
25%     4.750000
50%     8.500000
75%    30.250000
max    40.000000